%%2020.4.23 以下是我修改后优势分组的程序，只需要最后把优势分组的xlsx文件转化成txt文件即可完成优势分组   
clc;
clear all;
X1=[0.8408 	0.5172 	0.1599 ];
X2=[0.4848 	0.0000 	0.8746 ];
X3=[-0.4870 	0.8367 	0.2504 ];
X4=[-0.8833 	0.4540 	0.1167 ];%%4组宏观结构面产状，也是进行优势分组的聚类中心
Y=load('normal.txt'); %%由产状算出来的裂隙面单位法向量,3列
all1=load('all.txt');%%现场所有窗口数据，包括6列，前3列是1，后三列分别是迹线，倾向，倾角
j=length(Y);
%%值得注意的是，normal.txt和all.txt行数相同，而且都是互相对应的，这给后面的编程带来了很多方便。比如说，当normal中的第i个向量与X1的产状距离最小的时候，提取all中对应的的第i行即可
Z1=[];
Z2=[];
Z3=[];
Z4=[];
a=(1-(X1*Y').^2).^0.5;
b=(1-(X2*Y').^2).^0.5;
c=(1-(X3*Y').^2).^0.5;
d=(1-(X4*Y').^2).^0.5;
K1=1;K2=1;K3=1;K4=1;

for i=1:j
    if a(i)<b(i)&&a(i)<c(i)&&a(i)<d(i)
        Z1(K1,:)=all1(i,:);
        K1=K1+1;
    end
    if b(i)<a(i)&&b(i)<c(i)&&b(i)<d(i)
        Z2(K2,:)=all1(i,:);
        K2=K2+1;
    end
    if c(i)<a(i)&&c(i)<b(i)&&c(i)<d(i)
        Z3(K3,:)=all1(i,:);
        K3=K3+1;
    end
    if d(i)<a(i)&&d(i)<b(i)&&d(i)<c(i)
        Z4(K4,:)=all1(i,:);
        K4=K4+1;
    end
end
xlswrite('第1组.xlsx',Z1);%%将Z1中数据写入名为“第1组”的xlsx文件中%%
xlswrite('第2组.xlsx',Z2);%%将Z1中数据写入名为“第1组”的xlsx文件中%%
xlswrite('第3组.xlsx',Z3);%%将Z1中数据写入名为“第1组”的xlsx文件中%%
xlswrite('第4组.xlsx',Z4);%%将Z1中数据写入名为“第1组”的xlsx文件中%%